In [1]:
import pandas as pd

In [2]:
data=pd.read_csv('SalaryData_Train.csv')

In [3]:
data.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
data.isnull().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30161 entries, 0 to 30160
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            30161 non-null  int64
 1   workclass      30161 non-null  object
 2   education      30161 non-null  object
 3   educationno    30161 non-null  int64
 4   maritalstatus  30161 non-null  object
 5   occupation     30161 non-null  object
 6   relationship   30161 non-null  object
 7   race           30161 non-null  object
 8   sex            30161 non-null  object
 9   capitalgain    30161 non-null  int64
 10  capitalloss    30161 non-null  int64
 11  hoursperweek   30161 non-null  int64
 12  native         30161 non-null  object
 13  Salary         30161 non-null  object
dtypes: int64(5), object(9)
memory usage: 3.2+ MB

In [6]:
data.describe()

                age   educationno   capitalgain   capitalloss  hoursperweek
count  30161.000000  30161.000000  30161.000000  30161.000000  30161.000000
mean      38.438115     10.121316   1092.044064     88.302311     40.931269
std       13.134830      2.550037   7406.466611    404.121321     11.980182
min       17.000000      1.000000      0.000000      0.000000      1.000000
25%       28.000000      9.000000      0.000000      0.000000     40.000000
50%       37.000000     10.000000      0.000000      0.000000     40.000000
75%       47.000000     13.000000      0.000000      0.000000     45.000000
max       90.000000     16.000000  99999.000000   4356.000000     99.000000

In [ ]:
#Dropping duplicate rows

In [7]:
data1=data.drop_duplicates()

In [8]:
data1.shape

(26903, 14)

Label Encoding

In [15]:
from sklearn.preprocessing import LabelEncoder
labelencoder=LabelEncoder() 
data1.iloc[:,-1]=labelencoder.fit_transform(data1.iloc[:,-1])
data1.head(3)

C:\Users\rohi\anaconda3\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,39,State-gov,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,0
1,50,Self-emp-not-inc,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,0
2,38,Private,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,0

In [16]:
y=data1['Salary']

In [17]:
data2=pd.get_dummies(data1)

In [18]:
data2.head(2)

,age,educationno,capitalgain,capitalloss,hoursperweek,Salary,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,...,native_ Portugal,native_ Puerto-Rico,native_ Scotland,native_ South,native_ Taiwan,native_ Thailand,native_ Trinadad&Tobago,native_ United-States,native_ Vietnam,native_ Yugoslavia
0,39,13,2174,0,40,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,50,13,0,0,13,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [19]:
data3=data2.drop(data2.columns[[5]],axis=1)

In [20]:
data3.head(2)

,age,educationno,capitalgain,capitalloss,hoursperweek,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,workclass_ Self-emp-not-inc,...,native_ Portugal,native_ Puerto-Rico,native_ Scotland,native_ South,native_ Taiwan,native_ Thailand,native_ Trinadad&Tobago,native_ United-States,native_ Vietnam,native_ Yugoslavia
0,39,13,2174,0,40,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,50,13,0,0,13,0,0,0,0,1,...,0,0,0,0,0,0,0,1,0,0

In [21]:
X=data3.iloc[:,:]

In [ ]:
#Feature Engineering

In [22]:
from sklearn.tree import DecisionTreeClassifier

In [23]:
model=DecisionTreeClassifier()

In [24]:
model.fit(X,y)

DecisionTreeClassifier()

In [25]:
model.feature_importances_

array([1.64561307e-01, 1.17950561e-01, 1.25697132e-01, 4.46933721e-02,
       9.54264843e-02, 6.79738787e-03, 8.34178494e-03, 1.30648319e-02,
       8.35191655e-03, 1.02537801e-02, 6.20627660e-03, 0.00000000e+00,
       3.82057344e-04, 2.74426389e-04, 2.95138839e-04, 1.17531991e-04,
       2.02373199e-04, 6.60471293e-04, 4.59392298e-04, 2.45246287e-03,
       3.65593595e-03, 1.41575468e-03, 7.63297649e-04, 3.77774107e-03,
       2.09015533e-03, 2.06763396e-04, 1.19201749e-03, 4.17839897e-03,
       3.16365674e-03, 6.99268104e-04, 2.12440396e-01, 5.89274104e-04,
       3.93124369e-03, 1.25887914e-03, 9.91939482e-04, 6.77380257e-03,
       0.00000000e+00, 8.99718966e-03, 1.04156674e-02, 3.21393383e-03,
       3.99997268e-03, 5.06336338e-03, 6.26926772e-03, 4.96958185e-05,
       8.88479381e-03, 4.68647711e-03, 9.54594409e-03, 4.72391401e-03,
       6.35059585e-03, 2.95747776e-03, 3.95614987e-03, 1.61470757e-03,
       2.25950216e-03, 2.46107502e-03, 5.33113648e-03, 1.64828013e-03,
       1.94167166e-03, 4.78621720e-03, 1.02486820e-03, 8.35875269e-03,
       6.40471366e-03, 5.67386526e-03, 6.08402215e-04, 1.31815473e-03,
       8.02622701e-04, 3.45383551e-05, 9.98237366e-04, 1.44336731e-04,
       0.00000000e+00, 2.37843673e-04, 1.56071711e-03, 5.28288884e-04,
       1.12698274e-03, 3.26874975e-04, 1.98302593e-04, 5.80908262e-05,
       0.00000000e+00, 2.37724498e-04, 1.29517029e-04, 7.40429328e-04,
       5.40473663e-04, 3.15908695e-04, 9.72327948e-04, 7.15868725e-04,
       1.03099018e-03, 2.87476420e-04, 9.10722147e-04, 1.03615065e-04,
       1.55422598e-04, 1.03615065e-04, 1.23036184e-03, 2.61940046e-04,
       1.76100664e-04, 5.04555724e-04, 0.00000000e+00, 8.77632382e-04,
       3.21573026e-04, 1.85614896e-04, 1.90075175e-04, 7.09542550e-03,
       4.38732648e-04, 5.94057942e-04])

In [27]:
X1 = data3.drop(data3.columns[[ 15, 25, 26, 36, 38, 65, 67, 74, 77, 84, 85, 89, 94, 96, 97]], axis = 1)

#Dropping those columns whose feature importance is less

In [28]:
#Splitting data into train and test

from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(X1, y, test_size = 0.33, random_state = 33)

In [29]:
#Fitting Model

from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(x_train, y_train);

In [30]:
pred1 = model.predict(x_test)

In [31]:
from sklearn.metrics import confusion_matrix

In [32]:
### Test Accuracy
pred1 = model.predict(x_test)
cm = confusion_matrix(y_test, pred1)
print(cm)
print("Accuracy:", ((5167+1862)/(5167+1862+1408+441))*100)

[[5167 1408]
 [ 441 1862]]
Accuracy: 79.1732372155891

In [33]:
### Train Accuracy
pred2 = model.predict(x_train)
cm = confusion_matrix(y_train, pred2)
print(cm)
print("Accuracy:",((10690+3703)/(10690+3703+2758+874))*100)

[[10690  2758]
 [  874  3703]]
Accuracy: 79.8502080443828

Our Model generalizes very well to the unseen data. Both train and test accuracies are nearly equal

In [34]:
###m Final Model for predicting on test dataset 
MODEL = GaussianNB()
MODEL.fit(X1, y);

# Test data

In [36]:
data = pd.read_csv("SalaryData_Test.csv")

In [37]:
data.head()

,age,workclass,education,educationno,maritalstatus,occupation,relationship,race,sex,capitalgain,capitalloss,hoursperweek,native,Salary
0,25,Private,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,34,Private,10th,6,Never-married,Other-service,Not-in-family,White,Male,0,0,30,United-States,<=50K

In [38]:
data.isnull().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [39]:
data.describe()

                age   educationno   capitalgain   capitalloss  hoursperweek
count  15060.000000  15060.000000  15060.000000  15060.000000  15060.000000
mean      38.768327     10.112749   1120.301594     89.041899     40.951594
std       13.380676      2.558727   7703.181842    406.283245     12.062831
min       17.000000      1.000000      0.000000      0.000000      1.000000
25%       28.000000      9.000000      0.000000      0.000000     40.000000
50%       37.000000     10.000000      0.000000      0.000000     40.000000
75%       48.000000     13.000000      0.000000      0.000000     45.000000
max       90.000000     16.000000  99999.000000   3770.000000     99.000000

In [40]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15060 entries, 0 to 15059
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   age            15060 non-null  int64
 1   workclass      15060 non-null  object
 2   education      15060 non-null  object
 3   educationno    15060 non-null  int64
 4   maritalstatus  15060 non-null  object
 5   occupation     15060 non-null  object
 6   relationship   15060 non-null  object
 7   race           15060 non-null  object
 8   sex            15060 non-null  object
 9   capitalgain    15060 non-null  int64
 10  capitalloss    15060 non-null  int64
 11  hoursperweek   15060 non-null  int64
 12  native         15060 non-null  object
 13  Salary         15060 non-null  object
dtypes: int64(5), object(9)
memory usage: 1.6+ MB

In [41]:
DF1 = data.drop_duplicates()

In [42]:
DF1.shape

(14130, 14)

In [ ]:
#Label Encoder

In [43]:
from sklearn.preprocessing import LabelEncoder
labelencoder = LabelEncoder()
DF1.iloc[:, -1] = labelencoder.fit_transform(DF1.iloc[:,-1])
#DF1.head(3)

C:\Users\rohi\anaconda3\lib\site-packages\pandas\core\indexing.py:966: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [44]:
Y = DF1['Salary']

In [45]:
DF2 = pd.get_dummies(DF1)

In [46]:
DF2.head(2)

,age,educationno,capitalgain,capitalloss,hoursperweek,Salary,workclass_ Federal-gov,workclass_ Local-gov,workclass_ Private,workclass_ Self-emp-inc,...,native_ Portugal,native_ Puerto-Rico,native_ Scotland,native_ South,native_ Taiwan,native_ Thailand,native_ Trinadad&Tobago,native_ United-States,native_ Vietnam,native_ Yugoslavia
0,25,7,0,0,40,0,0,0,1,0,...,0,0,0,0,0,0,0,1,0,0
1,38,9,0,0,50,0,0,0,1,0,...,0,0,0,0,0,0,0,1,0,0

In [47]:
DF3 = DF2.drop(DF2.columns[[5]], axis = 1)

In [48]:
X = DF3.iloc[:,:]

In [49]:
X = DF3.drop(DF3.columns[[ 15, 25, 26, 36, 38, 65, 67, 74, 77, 84, 85, 89, 94, 96, 97]], axis = 1)

In [ ]:
#Train Accuracy

In [50]:
### Train Accuracy
pred4 = MODEL.predict(X1)
cm = confusion_matrix(y, pred4)
print(cm)
print("Accuracy:", ((15820+5592)/(15820+5592+4203+1288))*100)

[[15820  4203]
 [ 1288  5592]]
Accuracy: 79.58963684347471

In [51]:
### Test Accuracy
pred3 = MODEL.predict(X)
cm = confusion_matrix(Y, pred3)
print(cm)
print("Accuracy:", ((8341+2874)/(8341+2874+2279+636))*100)

[[8341 2279]
 [ 636 2874]]
Accuracy: 79.37013446567587

Our Model generalizes very well to the unseen data. Both train and test accuracies are nearly equal.